import { store } from "../redux/store"

export const msgs = {

    // error message
    1000 : {
        'ar' : "حدثت مشكلة ما "
    },
    2000 : {
        "ar" : "تم تسجيل الدخول"
    },
    3000 : {
        "ar" : 'تم تسجيل الخروج'
    },
    4000 : {
        "ar" : 'تم إنشاء حساب'
    },
    5000 : {
        "ar" : 'تم إعادة تعيين كلمة المرور'
    },
    6000 : {
        "ar" : 'تم تعديل البيانات'
    },
    7000 : {
        "ar" : 'تم إنشاء عنوان جديد'
    },
    8000 : {
        "ar" : 'تم تعديل العنوان'
    },
    9000 : {
        "ar" : 'تم حذف العنوان'
    },
    10000 : {
        "ar" : 'تم إضافة الأقسام إلي المجموعة'
    },
    11000 : {
        "ar" : 'تم حذف مجموعة الأقسام'
    },
    12000 : {
        "ar" : 'تم إنشاء قسم جديد'
    },
    13000 : {
        "ar" : 'تم إنشاء مجموعة أقسام جديدة'
    },
    14000 : {
        "ar" : 'مجموعة الأقسام متكررة'
    },
    15000 : {
        "ar" : 'تم تعديل القسم'
    },
    16000 : {
        "ar" : 'تم حذف القسم'
    },
    17000 : {
        "ar" : 'تم حذف صورة القسم'
    },
    18000 : {
        "ar" : 'تم إنشاء المنتج'
    },
    19000 : {
        "ar" : 'تم حذف الصورة'
    },
    20000 : {
        "ar" : 'تم حذف المنتج'
    },
    21000 : {
        "ar" : 'تم تعديل المنتج'
    },
    22000 : {
        "ar" : 'تم إنشاء المستخدم جديد'
    },
    23000 : {
        "ar" : 'لا يمكن للمستخدم حذف الحساب الخاص به'
    },
    24000 : {
        "ar" : 'تم حذف المستخدم'
    },
    25000 : {
        "ar" : 'تم النسخ إلي الحافظة'
    },
}