import { store } from "../redux/store"

export const msgs = {

    // error message
    1000 : {
        'ar' : "حدثت مشكلة ما "
    },
    2000 : {
        "ar" : "تم تسجيل الدخول"
    },
    3000 : {
        "ar" : 'تم تسجيل الخروج'
    },
    4000 : {
        "ar" : 'تم إنشاء حساب'
    },
    5000 : {
        "ar" : 'تم إعادة تعيين كلمة المرور'
    },
    6000 : {
        "ar" : 'تم تعديل البيانات'
    },
    7000 : {
        "ar" : 'تم إنشاء عنوان جديد'
    },
    8000 : {
        "ar" : 'تم تعديل العنوان'
    },
    9000 : {
        "ar" : 'تم حذف العنوان'
    },
    10000 : {
        "ar" : 'تم إرسال رسالتك'
    },
    11000 : {
        "ar" : 'لا يمكن تكرار الإرسال في وقت قصير'
    },
    12000 : {
        "ar" : 'الرجاء تقييم المنتج'
    }
}